In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range('20130101', periods = 6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [9]:
df = pd.DataFrame(np.random.randn(6,4), index = dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.200076  0.949624 -0.248619 -0.052266
2013-01-02 -1.209251 -1.169397  0.356516  0.060945
2013-01-03 -0.530716 -1.344028  0.271132 -0.399194
2013-01-04 -1.004598  0.469880 -0.765389 -0.517967
2013-01-05  0.359700 -1.210643  0.190867 -1.099042
2013-01-06 -2.172837 -0.113261 -0.369591  0.677178

In [10]:
df2 = pd.DataFrame({'A': 1.,
   ...:                     'B': pd.Timestamp('20130102'),
   ...:                     'C': pd.Series(1, index=list(range(4)), dtype='float32'),
   ...:                     'D': np.array([3] * 4, dtype='int32'),
   ...:                     'E': pd.Categorical(["test", "train", "test", "train"]),
   ...:                     'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [14]:
df.head()

                   A         B         C         D
2013-01-01  0.200076  0.949624 -0.248619 -0.052266
2013-01-02 -1.209251 -1.169397  0.356516  0.060945
2013-01-03 -0.530716 -1.344028  0.271132 -0.399194
2013-01-04 -1.004598  0.469880 -0.765389 -0.517967
2013-01-05  0.359700 -1.210643  0.190867 -1.099042

In [12]:
df.tail(3)

                   A         B         C         D
2013-01-04 -1.004598  0.469880 -0.765389 -0.517967
2013-01-05  0.359700 -1.210643  0.190867 -1.099042
2013-01-06 -2.172837 -0.113261 -0.369591  0.677178

In [15]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.726271 -0.402971 -0.094181 -0.221724
std    0.946465  0.979862  0.440013  0.600930
min   -2.172837 -1.344028 -0.765389 -1.099042
25%   -1.158088 -1.200331 -0.339348 -0.488273
50%   -0.767657 -0.641329 -0.028876 -0.225730
75%    0.017378  0.324094  0.251066  0.032643
max    0.359700  0.949624  0.356516  0.677178

## 행과 열을 바꾸는 방법

In [16]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.200076   -1.209251   -0.530716   -1.004598    0.359700   -2.172837
B    0.949624   -1.169397   -1.344028    0.469880   -1.210643   -0.113261
C   -0.248619    0.356516    0.271132   -0.765389    0.190867   -0.369591
D   -0.052266    0.060945   -0.399194   -0.517967   -1.099042    0.677178

In [17]:
df.A

2013-01-01    0.200076
2013-01-02   -1.209251
2013-01-03   -0.530716
2013-01-04   -1.004598
2013-01-05    0.359700
2013-01-06   -2.172837
Freq: D, Name: A, dtype: float64

In [18]:
df["A"]

2013-01-01    0.200076
2013-01-02   -1.209251
2013-01-03   -0.530716
2013-01-04   -1.004598
2013-01-05    0.359700
2013-01-06   -2.172837
Freq: D, Name: A, dtype: float64

In [19]:
df.loc[dates[0]]

A    0.200076
B    0.949624
C   -0.248619
D   -0.052266
Name: 2013-01-01 00:00:00, dtype: float64

In [21]:
df.loc[dates[0], 'A']

0.20007583836490206

In [22]:
df

                   A         B         C         D
2013-01-01  0.200076  0.949624 -0.248619 -0.052266
2013-01-02 -1.209251 -1.169397  0.356516  0.060945
2013-01-03 -0.530716 -1.344028  0.271132 -0.399194
2013-01-04 -1.004598  0.469880 -0.765389 -0.517967
2013-01-05  0.359700 -1.210643  0.190867 -1.099042
2013-01-06 -2.172837 -0.113261 -0.369591  0.677178

In [23]:
df.iloc[3]

A   -1.004598
B    0.469880
C   -0.765389
D   -0.517967
Name: 2013-01-04 00:00:00, dtype: float64

In [24]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -1.004598  0.469880
2013-01-05  0.359700 -1.210643

 ## 10분 pandas [45] 라인부터 다시시작